# -*- coding: utf-8 -*-
#Реализовать на Flask

#1. По адресу /locales должен возвращаться массив в формате json с тремя локалями: ['ru', 'en', 'it']
#2. По адресу /sum/<int:first>/<int:second> должен получать в url-адресе два числа, возвращать их сумму
#3. По адресу /greet/<user_name> должен получать имя пользователя, возвращать текст 'Hello, имя_которое_прислали'
'''4. По адресу /form/user должен принимать POST запрос с параментрами: email, пароль и подтверждение пароля. Необходимо валидировать email, что обязательно присутствует, валидировать пароли, что они минимум 6 символов в длину и совпадают. Возрващать пользователю json вида: 
 "status" - 0 или 1 (если ошибка валидации),
 "errors" - список ошибок, если они есть,
 или пустой список.
'''
#5. По адресу /serve/<path:filename> должен возвращать содержимое запрашиваемого файла из папки ./files. Файлы можно туда положить любые текстовые. А если такого нет - 404.